// Задача 13: Напишите программу, которая выводит третью цифру заданного числа
//  или сообщает, что третьей цифры нет.

// 645 -> 5

// 78 -> третьей цифры нет

// 32679 -> 6

// Console.WriteLine("Введите число");
// int num3 = Convert.ToInt32(Console.ReadLine());

// while (first > 999)
// {
    
//     int first = num3 / 10;
//     Console.WriteLine(first); 
// }
// if (99 < num3)
// {
   
// }

// else
// {
//     Console.WriteLine("Третьей цифры нет");
// }

